app/views/sushis/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."sushi_id" = ?  [["sushi_id", 5]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."sushi_id" = ?  [["sushi_id", 5]]
---
<%= link_to @sushi.ocean.name, ocean_path(@sushi.ocean.id), method: :get %>
<% if @sushi.reviews.count > 0 %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."sushi_id" = ?  [["sushi_id", 6]]
---
<br><h3>All Reviews💬</h3><br>
<% @sushi.reviews.each do |review| %>