app/views/orders/new.html.erb


<%= button_to "Yes", orders_path(:order => {customer_id: Customer.last.id, sushi_id: surprise.id}), method: :post %><br>
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."id" DESC LIMIT ?  [["LIMIT", 1]]

<%= f.label :customer_id, 'Customer' %>
<%= f.collection_select :customer_id, Customer.all, :id, :name, :selected => Customer.last.id %>
---
SELECT "customers".* FROM "customers" ORDER BY "customers"."id" DESC LIMIT ?  [["LIMIT", 1]]