app/views/orders/new.html.erb

SELECT "sushis".* FROM "sushis"
---
    <marquee scrollamount="15" direction="left">
        <% surprise = Sushi.all.sample %>

SELECT "customers".* FROM "customers" ORDER BY "customers"."id" DESC LIMIT ?  [["LIMIT", 1]]
---

    <%= button_to "Yes", orders_path(:order => {customer_id: Customer.last.id, sushi_id: surprise.id}), method: :post, class:"btn btn-dark btn-lg" %><br>

SELECT "customers".* FROM "customers" ORDER BY "customers"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
    <%= f.label :customer_id, 'Customer' %>
    <%= f.collection_select :customer_id, Customer.all, :id, :name, :selected => Customer.last.id %>

SELECT "sushis".* FROM "sushis"
---
    <%= f.label :sushi_id, 'Sushi' %>
    <%= f.collection_select :sushi_id, Sushi.all, :id, :name %>