app/views/oceans/show.html.erb

<p><p class="font-weight-bold"><%= @ocean.name %></p> has the following sushi(s):<br><br>
<% @ocean.sushis.each do |sushi| %>
---
SELECT "sushis".* FROM "sushis" WHERE "sushis"."ocean_id" = ?  [["ocean_id", 2]]