app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "James Tester"], ["created_at", "2020-05-26 21:21:31.404568"], ["updated_at", "2020-05-26 21:21:31.404568"]]
---
    def create
        @customer = Customer.create(customer_params)