app/controllers/oceans_controller.rb

    def index
        @oceans = Ocean.all
---
SELECT "oceans".* FROM "oceans"

    def show
        @ocean = Ocean.find(params[:id])
---
SELECT "oceans".* FROM "oceans" WHERE "oceans"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]