app/controllers/orders_controller.rb

INSERT INTO "orders" ("customer_id", "sushi_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["customer_id", 11], ["sushi_id", 8], ["created_at", "2020-05-29 00:42:36.438311"], ["updated_at", "2020-05-29 00:42:36.438311"]]
---
    def create
        @order = Order.create(order_params)