app/controllers/reviews_controller.rb

    def create
        @review = Review.create(review_params)
---
INSERT INTO "reviews" ("customer_id", "sushi_id", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 5], ["sushi_id", 4], ["rating", 3], ["created_at", "2020-05-26 16:54:43.591924"], ["updated_at", "2020-05-26 16:54:43.591924"]]

    def edit
        @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

    def update
        @review = Review.find(params[:id])
        @review.update(review_params)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 4], ["updated_at", "2020-05-26 16:54:48.517497"], ["id", 11]]