app/controllers/sushis_controller.rb

    def index
        @sushis = Sushi.all
---
SELECT "sushis".* FROM "sushis"

    def show
        cookies[:sushi_counter] = cookies[:sushi_counter].to_i + 1
        @sushi = Sushi.find(params[:id])
---
SELECT "sushis".* FROM "sushis" WHERE "sushis"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]