app/models/sushi.rb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."sushi_id" = ?  [["sushi_id", 1]]
---
    def average
        self.reviews.map { |review| review.rating }.sum / self.reviews.count